# ViewSolarstudySingledayPresetIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudySingledayPresetIndex Property
ParameterTypeId Class See Also
---
"Single day presets combo"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudySingledayPresetIndex { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudySingledayPresetIndex As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudySingledayPresetIndex {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace